export type Project = {
  title: string;
  type: string;
  code?: string;
  period: string;
  role: "主持" | "参与";
};

export const projects: Project[] = [
  { title: "航天轨道数据库与数字轨道模型开发", type: "横向课题", code: "2025370202001999", period: "2025.07—2026.06", role: "主持" },
  { title: "结合扩散模型与最优传输的4D人脸生成研究", type: "山东省自然科学基金面上项目", code: "ZR2024MF087", period: "2025.01—2027.12", role: "主持" },
  { title: "基于共形结构与最优传输的颅骨身份认证", type: "国家自然科学基金面上项目", code: "62172247", period: "2022.01—2025.12", role: "主持" },
  { title: "儿童智能化建模软件", type: "横向课题", code: "2023370203004281", period: "2023.11—2024.11", role: "主持" },
  { title: "面向航天应用的可视化增强现实软件技术开发", type: "横向课题", code: "20213702021579", period: "2021.10—2022.01", role: "主持" },
  { title: "基于稀疏统计模型的高维数据分析及其应用研究", type: "国家统计局项目", code: "2020LY100", period: "2020.09—2022.09", role: "主持" },
  { title: "基于内蕴几何结构的颅面相似度计算与复原", type: "国家自然科学基金青年项目", code: "61702293", period: "2018.01—2020.12", role: "主持" },
  { title: "形状空间下基于测地线的三维人脸分析与超分辨率重建", type: "中国博士后科学基金面上项目", code: "2017M622137", period: "2017.11—2019.11", role: "主持" },
  { title: "计算机辅助颅面复原与评价研究", type: "虚拟现实应用教育部工程研究中心项目", code: "MEOBNUEVRA201601", period: "2016.09—2019.10", role: "主持" },
  { title: "基于解剖结构的三维颅相重合研究", type: "国家自然科学基金面上项目", code: "61572078", period: "2016.01—2019.12", role: "参与" },
  { title: "稀疏表示框架下融合整体结构信息和局部平滑约束的高逼真人脸素描合成方法", type: "国家自然科学基金项目", code: "61402040", period: "2015.01—2017.12", role: "参与" },
  { title: "工业制造设备预测性维护的关键技术研究", type: "山东省重大研究计划", code: "2019JZZY020101", period: "2019.01—2021.12", role: "参与" },
  { title: "基于样本固有差异消除的三维人脸老化模拟方法研究", type: "北京市自然科学基金项目", code: "4152028", period: "2015.01—2017.06", role: "参与" },
  { title: "支持多尺度空间无缝过渡的数据组织耦合模型", type: "山东省自然科学基金", code: "D010701", period: "2017.05—2019.05", role: "参与" },
  { title: "2020年工业互联网创新发展工程——工业互联网平台应用创新推广中心项目", type: "工业和信息化部项目", code: "TC200802B", period: "2020.01—2022.12", role: "参与" },
  { title: "面向绿色无线通信的高性能无线传输技术研究", type: "国家自然科学基金项目", code: "61301146", period: "2014.01—2016.12", role: "参与" },
];

